OpenFOAM/elliot-7/Dissertation/H/Initial Cases/simpleH/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet1
    {
        type            patch;
        nFaces          100;
        startFace       19500;
    }
    inlet2
    {
        type            patch;
        nFaces          100;
        startFace       19600;
    }
    outlet1
    {
        type            patch;
        nFaces          100;
        startFace       19700;
    }
    outlet2
    {
        type            patch;
        nFaces          100;
        startFace       19800;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2600;
        startFace       19900;
    }
)

// ************************************************************************* //
